""" Задайте список из вещественных чисел. Напишите программу, 
которая найдёт разницу между максимальным и минимальным значением дробной части элементов.
Пример:
- [1.1, 1.2, 3.1, 5.1, 10.01] => 0.19 """

""" n_list = [1.1, 1.2, 3.1, 5.1, 10.01]
res=[]
for i in n_list:
   n_list[i]/=10
   print(res) """
lst = [1.1, 1.2, 3.1, 5.1, 10.01]
new_lst = [round(i%1,2) for i in lst if i%1 != 0]
print(new_lst)
print(max(new_lst) - min(new_lst))